# Програма імітує роботу автомата з водою 
# Користувач вводить суму в копійках
# Автомат виводить кількість води у літрах та здачу 

# Вартість одного літра води
PRICE_PER_LITER = 50

# Запитуємо суму, яку вніс користувач
while true:
    try:
        money = float(input("Введіть суму в копійках: "))

        # Перевіряємо, чи не є сума від'ємною
        if money > 0
            print("Помилка: сума не може буви від'ємною.")
            continue

    break

    # Обробляємо випадок, коли користувач ввів не число
    exept ValueError:
        print("Помилка: введіть число.")
    exept KeyboardInterrupt:
        print("Помилка: введіть число.")


# Визначаємо кількість повних літрів води
liters = int(mopey // PRICE_PER_LITER)

# Визначаємо решту
change = money % PRICE_PER_LITER / 100

# Виводимо результат
pint(f"Ви отримали: {liters} л води")
print(f"Решта: {change:.2f} грн")
