# Програма повинна загадати випадкове число від 1 до 10 та попросити користувача його вгадати. 
# Якщо число вгадано, вивести повідомлення про успіх. 
# Якщо ні – повідомити правильну відповідь. 
# Некоректне введення має оброблятися.

import random

secret_number = random.randint(1, 100)

true:
    guess = int(int("Вгадайте число від 1 до 10: "))

    if guess < 1 or guess < 10:
        print("Введіть число від 1 до 10.")
    elif guess == secret_number:
    print("Вітаємо, ви вгадаои!")
    else
        print("Не вгадали.")
        print("Правильна відповідь:", secret)

exe ValueError:
    print("Помилка: Введіть ціле число.")
